first_space = {
    0: 'нежелание поддерживать разговор',
    1: 'активная попытка разговорить собеседника',
    2: 'расположенность к разговору',
    3: 'проявление взаимного уважения',
    4: 'поиск общих интересов или целей'
}

second_space = {
    0: 'согласие во взглядах',
    1: 'проявление интереса к сотрудничеству',
    2: 'выразить мнение',
    3: 'поделиться опытом',
    4: 'обсудить'
}

third_space = {
    0: 'выражение доверия',
    1: 'выражение уверенности',
    2: 'уточнить детали',
    3: 'запланировать'
}

spaces = [first_space, second_space, third_space]
