import numpy

first_space_int = {
    0: 'вовлечь в диалог',
    1: 'выразить недовольство',
    2: 'задавать вопросы',
    3: 'обратить внимание',
    4: 'проявить инициативу',
    5: 'рассказать',
    6: 'выразить понимание'
}

second_space_int = {
    0: 'выразить свое мнение',
    1: 'отрицать',
    2: 'оценить',
    3: 'поддержать',
    4: 'пояснить',
    5: 'предложить',
    6: 'предположить',
    7: 'уточнить',
    8: 'поделиться опытом',
}

third_space_int = {
    0: 'выразить надежду',
    1: 'выразить обеспокоенность',
    2: 'выразить согласие',
    3: 'завершить разговор',
    4: 'подтвердить',
    5: 'поставить цель',
    6: 'убедить'
}

spaces_int = [first_space_int, second_space_int, third_space_int]

first_space_img = {
    0: 'коммуникативность',
    1: 'дружелюбность',
    2: 'любознательность',
    3: 'внимательность',
    4: 'инициативность',

}

second_space_img = {
    0: 'уверенность',
    1: 'критичность',
    2: 'инициативность',
    3: 'заботливость',
    4: 'внимательность',
    5: 'коммуникабельность'

}

third_space_img = {
    0: 'уверенность',
    1: 'целеустремленность',
    2: 'оптимизм',
    3: 'абмициозность',
    4: 'пронициательность',

}

spaces_img = [first_space_img, second_space_img, third_space_img]

space_1_matrix = numpy.array([
    [1, -0.2, 0.5, 0.3, 0.5, 0.75, 0.1],
    [0.2, -0.8, 0.4, 0.2, 0.5, 0.7, 0.2],
    [0.3, -0.1, 1, 0.7, 0.2, 0.2, 0.1],
    [0.2, -0.2, 0.6, 1, 0.3, 0.3, 0.2],
    [0.7, -0.1, 0.3, 0.3, 1, 0.4, 0.2]
])

space_2_matrix = numpy.array([
    [0.95, -0.1, 0.1, 0.1, 0.5, 0.3, 0.1, 0.2, 0.34],
    [0.1, 0.95, 0.1, -0.5, 0.2, 0.1, 0.1, 0.05, 0.05],
    [0.8, -0.1, 0.2, 0.1, 0.4, 0.9, 0.1, 0.1, 0.2],
    [0.05, -0.1, 0.3, 0.9, 0.1, 0.2, 0.1, 0.2, 0.1],
    [0.2, 0.1, 0.2, 0.21, 0.9, 0.1, 0.2, 0.8, 0.4],
    [0.7, -0.5, 0.6, 0.2, 0.4, 0.6, 0.4, 0.4, 0.7]
])

space_3_matrix = numpy.array([
    [0.7, -0.7, 0.2, 0.1, 0.4, 0.8, 0.6],
    [0.2, -0.5, 0.2, 0.1, 0.4, 0.2, 0.3],
    [0.6, -0.4, 0.5, 0.1, 0.3, 0.5, 0.1],
    [0.5, -0.5, 0.2, 0.1, 0.5, 0.9, 0.1],
    [0.2, 0.1, 0.2, 0.21, 0.5, 0.1, 0.2]
])

matrices = [space_1_matrix, space_2_matrix, space_3_matrix]
